#+TODO: TODO NEXT | DONE

* Studium
#+BEGIN: clocktable :maxlevel 3 :scope subtree
Clock summary at [2013-01-04 Fr 19:33]

| Headline                            | Time   |      |      |
|-------------------------------------+--------+------+------|
| *Total time*                        | *9:22* |      |      |
|-------------------------------------+--------+------+------|
| Studium                             | 9:22   |      |      |
| TODO Elementare Stochastik Zettel 8 |        | 9:22 |      |
| Tag 3                               |        |      | 3:44 |
| Tag 2                               |        |      | 2:49 |
| Tag 1                               |        |      | 2:49 |
#+END:


** TODO Elementare Stochastik Zettel 8
*** Tag 4
*** Tag 3
    CLOCK: [2013-01-03 Do 22:00]--[2013-01-03 Do 23:00] =>  1:00
    CLOCK: [2013-01-03 Do 19:34]--[2013-01-03 Do 20:49] =>  1:15
    CLOCK: [2013-01-03 Do 17:54]--[2013-01-03 Do 18:02] =>  0:08
    CLOCK: [2013-01-03 Do 14:00]--[2013-01-03 Do 15:00] =>  1:00
    CLOCK: [2013-01-03 Do 12:38]--[2013-01-03 Do 12:59] =>  0:21
    :PROPERTIES:
    :Effort:   4:00
    :END:
*** Tag 2
    CLOCK: [2013-01-02 Mi 17:58]--[2013-01-02 Mi 18:51] =>  0:53
    CLOCK: [2013-01-02 Mi 15:42]--[2013-01-02 Mi 17:38] =>  1:56
    :PROPERTIES:
    :Effort:   4:00
    :END:
    
*** Tag 1
    CLOCK: [2013-01-02 Mi 00:33]--[2013-01-02 Mi 01:19] =>  0:46
    CLOCK: [2013-01-01 Di 21:24]--[2013-01-01 Di 21:54] =>  0:30
    CLOCK: [2013-01-01 Di 20:12]--[2013-01-01 Di 21:05] =>  0:53
    CLOCK: [2013-01-01 Di 18:05]--[2013-01-01 Di 18:45] =>  0:40

*** next Steps

** TODO Theorethische Informatik Zettel 10
*** DONE Grundfundament im Zettelkasten erstellen
*** DONE Zettel einmal komplett sichten
*** TODO sammeln von Hinweisen und Fragmenten zu Aufgaben:
**** DONE 1
**** TODO 2
**** TODO 3
*** TODO lösen von:
**** DONE 1
**** TODO 2
**** TODO 3
*** Tag 1
    CLOCK: [2013-01-06 So 19:56]--[2013-01-06 So 21:01] =>  1:05
    CLOCK: [2013-01-06 So 17:09]--[2013-01-06 So 17:47] =>  0:38

*** Tag 4
** TODO Logik Zettel 10
** TODO Website
*** TODO Struktur von Inhalt planen


* Projekte
** Emacs Config Aufräumen
*** NEXT überflüssige keymapping dateien entfernen
*** TODO nicht mehr benutzte dateien in .emacs.d löschen
*** TODO alle shortcuts in .emacs zusammenfassen
*** DONE funktionen in .emacs auslagern
    CLOCK: [2013-01-14 Mo 19:59]--[2013-01-14 Mo 20:11] =>  0:12
*** TODO unnötige keybindings entfernen
*** DONE in bytecompiling einlesen
*** DONE alles bytecompilen
** Org-Mode Bilder
*** NEXT Möglichkeiten prüfen um informationen/texte einem konkreten Header zuzuordnen
*** TODO Möglichkeiten sammeln, zum zeilenweisen auslesen und splitten bei trennzeichene
*** TODO beim link erstellen eben jene information in extra ast unterbringen
*** TODO 2. löschenroutine, welche nach dem löschen eben diesen wert wieder ausliest
*** DONE Funktion bzw. Regex um links und die darin enthaltenen Bilder zu identifizieren
    \\[\\[\\(.*\\)\\]\\]  catched die links
    search-forward-regexp such entsprechend
    matched-string holt die einzelnen werte der letzten suche 
       (parameter 1 für die erste gruppe) oder 0 für ganzen string
    (goto-char (match-end 0))  um anfang und ende von link zu erreichen
    
(defun my-org-extract-link ()
  "Extract the link location at point and put it on the killring."
  (interactive)
  (when (org-in-regexp org-bracket-link-regexp 1)
    (kill-new (org-link-unescape (org-match-string-no-properties 1)))))

*** DONE Deletion Funktion für das Bild unter dem Cursor hinzufügen, falls slice, dann alle anderen slices finden
*** DONE Möglichkeiten nachträgliches resizen der Bilder im Org-Mode eruieren
    - macht innerhalb vom Orgmode bisher einfach keinen Sinn
*** DONE prüfen ob Bilder mit Linktext immernoch dargestellt werden, falls nicht, konfigurieren
*** DONE latex code in die linkbeschreibung pasten, klammern entsprechend entwerten
*** DONE extra Fenster bei Latexumwandlung unterdrücken; google save-excursion
*** DONE iimage bibliothek o.ä. code raussuchen und auf anpassparkeit prüfen
*** DONE anforderungen an eigenen Modus sammeln
*** DONE entsprechenden modus entwickeln ;image slicing
** Tags
*** DONE etags installieren
*** NEXT google: wie können tags zu den unterschiedlichen dokumentarten generiert werden
*** TODO google: welche navigations und sammelmöglichkeiten gibt es?
*** TODO Shortcuts für die Tags entsprechend legen
** Capturing
*** NEXT welche Captures ;-Templates; würden noch Sinn machen? Broweser/Client
*** DONE schnellere Shortcuts für Captures 
*** TODO Captures entsprechend implementieren
** Shortcuts
*** DONE shortcuts für scrolling in pentadactyl ummappen
*** DONE verschieben/retaggen von Fenstern in awesom wm
*** DONE mehr Tasten auf den Modalen Vim Modus setzen
*** DONE Firefox Zwang auf web lösen
*** DONE completion shortcuts bequemer machen			  :shortcuts:
*** DONE Orte mit -letzten- veränderungen oder sowas durchgehen; cyclen - plural
*** DONE shortcut für zuletzt benutztes bookmark		  :shortcuts:
*** DONE Shortcut Header Sprung besser legen			   :shortcut:
*** DONE Emacs wiederholung braucht ein besseres shortcut; z schwer zu finden :shortcut:
*** DONE zyklisches Pasten von Emacs aus Killring		  :shortcuts:
*** DONE shortcuts für erstellen von tmp autonamed bookmark und cyclen; in buffer :shortcuts:
** Sprungmarken
*** TODO Liste mit Features von Bookmark+ anfertigen
*** NEXT markierung und/oder anzeige für evil marks im Dokument anzeige ;goggle
nicht mehr zeit verschwenden, als unbedingt nötig, da die evil marks in jedem fall auch
durch autobookmarks ersetzt werden könnten
google: emacs+evil+show+mark 
** TodoListe optimieren
*** TODO Brainstorming, was Standardmäßig geöffnet und was geschlossen sein soll
*** TODO autostarts neu zuteilen ;source blöcke usw.
*** NEXT todo states und faces aus "your life in plaintext"
** Latex Mode
*** DONE Cdlatex Paket suchen und installieren
    ist total sinnlos, yasnippet kann das alles auch. Statt dessen eher mal nach math mode suchen
*** DONE testen in wie fern schnelles suchen und finden von Symbolen möglich ist
    - mit latex math mode lässt sich mit backtick
      und dann nem normalen Zeichen das latex äquivalent bilden
    z.B. * wird zu \times
    - für andere Zeichen gibt es helm-c-insert-latex
*** NEXT testen wie weit auto completion von viel genutzen symbolen -Rightarrow...- glatt läuft
   - man könnte natürlich yasnippet benutzen 
   - oder man schreibt eigene latex kürzel
*** TODO math mode und insert latex in workflow einbinden
*** TODO gegebenenfalls weitere Completion Methoden einsetzen
** Git
*** DONE die 3 Grundmerges finden ;a / b / beide
*** NEXT magit: commit und push?
** effizienteres Suchen
*** TODO Suchmaschine für Quellcodes
**** alternative rc.lua suchen
**** alternative .emacs suchen
*** TODO alternativen zu google prüfen / bessere Befehle sammeln
** awesome wm
*** NEXT Titlebar Awesome Wm googlen. Ziel: Titlebars in bestimmten Tags mit Floating standard, aktivieren.
*** TODO ansatz für tabs in awesome wm formulieren
*** TODO testen was genau shifty macht, und das gegebenenfalls einrichten
*** TODO nochmal die awesomewm konfiguration für tab's raussuchen und versuchen einen Plan zu entwickeln, um dieses sicher zu implementieren
** eshell
*** DONE Autocompletion Eshell googlen Ziel: Möglichkeit umzuschalten. Vielleicht andere Shortcuts?
*** DONE Autocompletion eshell fixen im moment wird bei tab direkt eingesetzt und es lässt sich nicht weiter schalten
*** TODO mehrere eshell's, und diese sollten auch von überall aus in einem separaten Frame geöffnet werden können
** someday / maybe
*** TODO Acejump näher betrachten
*** TODO ubuntu vs mint akku genau das bei google
*** TODO regex icicle und rx makro testen
*** TODO gnome keyring bug beheben
*** TODO festplatten automatisch laden 
*** TODO Netbook neu einrichten
- brainstorming, xorg (wieder) automatisch booten (google startx)
* interessanter Kram
** tiling windowmanager
*** notion wm / stump wm
*** euclid wm
*** lunchbox wm 
    hat z.B. alternativen ansatz für tabs
*** plwm
    toolkit um mit python nen windowmanager zu entwickeln

*** clfswm -kein reiner tiling manager, dafür common lisp-
*** xwem
** tiling in non tiling window managern - software -
   z.B. in fluxbox - +tabs -
*** stiler
*** pytyle
*** wumwum 
    - eher weniger verlocend im moment
*** PyWO
** im alten my-keymaps sehen, was noch an plugins benutzt wurde
** ubiquity
   einfach mal testen

** weitere pentadactyl shortcuts/befehle
** vimperator addons sammeln
** slime installieren und einrichten

* Todo-Eingang
** NEXT Übersicht in Software zu den verschiedenen Vim Substitutionen erstellen
** TODO prüfen: https://github.com/dgutov/point-stack/blob/master/point-stack.el
** DONE zusätzliche foldingsyntax / elemente einführen?
   vor allem kürzer als diese begin, end dinger
** DONE die Regex ausdrücke für Preview Latex in Org überarbeiten abstände zu $ sind scheiße
** TODO effizientere Wege überlegen, um Ordner zu erreichen
** TODO Keynav synchronisieren
* Todo-Eingang-Studium
** TODO Induktionsformalitäten neu sortieren
 [[file:~/Zettelkasten/zettelkasten.org::FIXME%20th11.1][file:~/Zettelkasten/zettelkasten.org::FIXME th11.1]]
 Entered on [2013-01-16 Mi 14:10]
** TODO Versuchen, die primitive Rekursivität in Bezug zu bringen
 [[file:~/Zettelkasten/zettelkasten.org::FIXME%20th11.2][file:~/Zettelkasten/zettelkasten.org::FIXME th11.2]]
 Entered on [2013-01-16 Mi 14:56]
** TODO Fehler mit der vergessenen 0 beheben
 [[file:~/Zettelkasten/zettelkasten.org::FIXME%20th11.3][file:~/Zettelkasten/zettelkasten.org::FIXME th11.3]]
 Entered on [2013-01-16 Mi 15:29]
** TODO maximum likelihood schätzer
 [[file:~/Zettelkasten/zettelkasten.org::*W%C3%B6rterbuch][Wörterbuch]]
 Entered on [2013-01-17 Do 12:30]
** TODO empirischer Erwartungswert / Varianz / erwartungstreue
 [[file:~/Zettelkasten/zettelkasten.org::*W%C3%B6rterbuch][Wörterbuch]]
 Entered on [2013-01-17 Do 12:31]
** TODO negative Binomialverteilung / Pascalverteilung
 [[file:~/Zettelkasten/zettelkasten.org::*W%C3%B6rterbuch][Wörterbuch]]
 Entered on [2013-01-17 Do 12:32]
* Todo Ausgang
** DONE gnus wieder für die mails einrichten
** DONE git: leere commits abschicken
** DONE AwesomeWm Shortcuts
*** DONE Ein/Ausblenden von Fenstern logischer legen
*** DONE jeweils recent Sprung für Fenster und tag (awesomewm)
    - im Moment win+escape und win+tab aber das geht auch besser
** DONE Keynav überprüfen (als Lösung für Screenshots)
   - rodentbane ist keynav, allerdings wurde das teil 
     komplett portiert, abhängigkeit ist nur zu allgemeineren
     tools gegeben
   => erweiterbarkeit sollte kein probem werden.
   siehe dazu: http://www.semicomplete.com/projects/xdotool/xdotool.xhtml
   mouse->keyup/keydown
   und [[~/.config/awesome/rodentbane.lua::function click(button)]]
** DONE tabbed untersuchen
   - eher unschön das ganze
** DONE Screenshots per Tastatur
** DONE flosub mit leertaste arbeiten lassen
** DONE Weiterspringen und besseres Shortcut für Regex Sprung
